protected/humhub/modules/user/models/forms/Registration.php

    public function register(\yii\authclient\ClientInterface $authClient = null)
    {
        $this->models['User']->language = Yii::$app->language;
        if ($this->enableUserApproval) {
            $this->models['User']->status = User::STATUS_NEED_APPROVAL;
            $this->models['User']->registrationGroupId = $this->models['GroupUser']->group_id;
---
SELECT EXISTS(SELECT * FROM `group_user` WHERE (`user_id`=2) AND (`group_id`='2'))