protected/humhub/modules/user/models/Profile.php

SELECT * FROM `profile_field`
---
    public function rules()
    {
        $rules = [
            [['user_id'], 'required'],
            [['user_id'], 'integer']
        ];

        foreach (ProfileField::find()->all() as $profileField) {

SELECT * FROM `profile_field`
---
    public function scenarios()
    {
        $scenarios = parent::scenarios();
        $scenarios['editAdmin'] = [];
        $scenarios['registration'] = [];
        $scenarios['editProfile'] = [];

        // Get synced attributes if user is set
        $syncAttributes = [];
        if ($this->user !== null) {
            $syncAttributes = \humhub\modules\user\authclient\AuthClientHelpers::getSyncAttributesByUser($this->user);
        }

        foreach (ProfileField::find()->all() as $profileField) {

SELECT * FROM `profile_field`
---
         * Yii::t('UserModule.models_Profile', 'Twitter URL')
         */
        $labels = [];
        foreach (ProfileField::find()->all() as $profileField) {

SELECT * FROM `profile_field_category` ORDER BY `sort_order`
SELECT * FROM `profile_field` WHERE `profile_field_category_id`=1 ORDER BY `sort_order`
---
    public function getFormDefinition()
    {
        $definition = array();
        $definition['elements'] = array();

        $syncAttributes = [];
        if ($this->user !== null) {
            $syncAttributes = \humhub\modules\user\authclient\AuthClientHelpers::getSyncAttributesByUser($this->user);
        }

        $safeAttributes = $this->safeAttributes();

        foreach (ProfileFieldCategory::find()->orderBy('sort_order')->all() as $profileFieldCategory) {

            $category = array(
                'type' => 'form',
                'title' => Yii::t($profileFieldCategory->getTranslationCategory(), $profileFieldCategory->title),
                'elements' => array(),
            );

            foreach (ProfileField::find()->orderBy('sort_order')->where(['profile_field_category_id' => $profileFieldCategory->id])->all() as $profileField) {