protected/humhub/modules/user/controllers/AuthController.php

    protected function login($user, $authClient)
    {
        $redirectUrl = ['/user/auth/login'];
        if ($user->status == User::STATUS_ENABLED) {
            $duration = 0;
            if ($authClient instanceof \humhub\modules\user\authclient\BaseFormAuth) {
                if ($authClient->login->rememberMe) {
                    $duration = Yii::$app->getModule('user')->loginRememberMeDuration;
                }
            }
            AuthClientHelpers::updateUser($authClient, $user);

            if (Yii::$app->user->login($user, $duration)) {
                $user->updateAttributes(['last_login' => new \yii\db\Expression('NOW()')]);
---
UPDATE `user` SET `last_login`=NOW() WHERE `id`=1